In [8]:
import pandas as pd
import numpy as np

In [2]:
cdf = pd.DataFrame(pd.read_csv('data/customer_demographics.csv'))
#customer_id 	Unique id for a customer

In [3]:
print(cdf.shape)
cdf.head()

(760, 7)

,customer_id,age_range,marital_status,rented,family_size,no_of_children,income_bracket
0,1,70+,Married,0,2,NaN,4
1,6,46-55,Married,0,2,NaN,5
2,7,26-35,NaN,0,3,1,3
3,8,26-35,NaN,0,4,2,6
4,10,46-55,Single,0,1,NaN,5

In [5]:
cdf.isna().sum()

customer_id         0
age_range           0
marital_status    329
rented              0
family_size         0
no_of_children    538
income_bracket      0
dtype: int64

In [6]:
# percentage if missing values
cdf.isnull().sum() * 100 / len(cdf)

customer_id        0.000000
age_range          0.000000
marital_status    43.289474
rented             0.000000
family_size        0.000000
no_of_children    70.789474
income_bracket     0.000000
dtype: float64

In [9]:
#marital status : Married=1, Single=0, NaN=-1
cdf['marital_status'] = cdf['marital_status'].replace({'Married':1, 'Single':0, np.nan:-1})
cdf.head()

,customer_id,age_range,marital_status,rented,family_size,no_of_children,income_bracket
0,1,70+,1,0,2,NaN,4
1,6,46-55,1,0,2,NaN,5
2,7,26-35,-1,0,3,1,3
3,8,26-35,-1,0,4,2,6
4,10,46-55,0,0,1,NaN,5

In [11]:
a = cdf['age_range'].str.findall('(\d+)')
a.head()

0        [70]
1    [46, 55]
2    [26, 35]
3    [26, 35]
4    [46, 55]
Name: age_range, dtype: object

In [12]:
b = pd.Series([])
for i in range(0,len(a)):
    a[i] = np.array(a[i]).astype(np.float)
    b[i] = sum(a[i]) / len(a[i])
b.head()

0    70.0
1    50.5
2    30.5
3    30.5
4    50.5
dtype: float64

In [14]:
cdf['age'] = b
cdf.head()

,customer_id,age_range,marital_status,rented,family_size,no_of_children,income_bracket,age
0,1,70+,1,0,2,NaN,4,70.0
1,6,46-55,1,0,2,NaN,5,50.5
2,7,26-35,-1,0,3,1,3,30.5
3,8,26-35,-1,0,4,2,6,30.5
4,10,46-55,0,0,1,NaN,5,50.5

In [16]:
cdf.family_size.unique()

array(['2', '3', '4', '1', '5+'], dtype=object)

In [26]:
cdf['family_size'] = cdf['family_size'].replace({'5+':5})
cdf.head()

,customer_id,age_range,marital_status,rented,family_size,no_of_children,income_bracket,age,family_size_category,childrens
0,1,70+,1,0,2,NaN,4,70.0,2,0
1,6,46-55,1,0,2,NaN,5,50.5,2,0
2,7,26-35,-1,0,3,1,3,30.5,3,1
3,8,26-35,-1,0,4,2,6,30.5,4,2
4,10,46-55,0,0,1,NaN,5,50.5,1,0

In [22]:
cdf.no_of_children.unique()

array([nan, '1', '2', '3+'], dtype=object)

In [24]:
cdf['childrens'] = cdf['no_of_children'].replace({'3+':3, np.nan:0})
cdf.head()

,customer_id,age_range,marital_status,rented,family_size,no_of_children,income_bracket,age,family_size_category,childrens
0,1,70+,1,0,2,NaN,4,70.0,S,0
1,6,46-55,1,0,2,NaN,5,50.5,S,0
2,7,26-35,-1,0,3,1,3,30.5,S,1
3,8,26-35,-1,0,4,2,6,30.5,L,2
4,10,46-55,0,0,1,NaN,5,50.5,S,0

In [39]:
print(cdf.income_bracket.unique())
cdf.income_bracket.value_counts(bins=3)

[ 4  5  3  6  1  7  2  8  9 12 10 11]

(0.988, 4.667]    362
(4.667, 8.333]    344
(8.333, 12.0]      54
Name: income_bracket, dtype: int64

In [40]:
cdf['income_range'] = pd.cut(cdf.income_bracket, 3, labels=['Middle','Upper Middle','Upper'])

In [42]:
print(cdf.shape)
cdf.head()

(760, 10)

,customer_id,age_range,marital_status,rented,family_size,no_of_children,income_bracket,age,childrens,income_range
0,1,70+,1,0,2,NaN,4,70.0,0,Middle
1,6,46-55,1,0,2,NaN,5,50.5,0,Upper Middle
2,7,26-35,-1,0,3,1,3,30.5,1,Middle
3,8,26-35,-1,0,4,2,6,30.5,2,Upper Middle
4,10,46-55,0,0,1,NaN,5,50.5,0,Upper Middle

In [44]:
cdf.to_csv('updated-data/updated_cd.csv', 
          columns=['customer_id','age','marital_status','rented','family_size','childrens','income_range'],
          index=False)